GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
#define NMEA_FIELD_MASK_TIME                          0x0001
#define NMEA_FIELD_MASK_POSITION                      0x0002
#define NMEA_FIELD_MASK_ALTITUDE                      0x0004
#define NMEA_FIELD_MASK_SPEED                         0x0008
#define NMEA_FIELD_MASK_COURSE                        0x0010
#define NMEA_FIELD_MASK_EHPE                          0x0020
#define NMEA_FIELD_MASK_EVPE                          0x0040
#define NMEA_FIELD_MASK_PDOP                          0x0080
#define NMEA_FIELD_MASK_HDOP                          0x0100
#define NMEA_FIELD_MASK_VDOP                          0x0200

#define NMEA_OPERATION_MANUAL                         0
#define NMEA_OPERATION_AUTOMATIC                      1

#define NMEA_NAVIGATION_NONE                          0
#define NMEA_NAVIGATION_2D                            1
#define NMEA_NAVIGATION_3D                            2

#define NMEA_STATUS_RECEIVER_WARNING                  0
#define NMEA_STATUS_DATA_VALID                        1

typedef struct _nmea_context_t {
    uint8_t             prefix;                             /* NMEA PREFIX (GP, GL, GN)     */
    uint8_t             sequence;                           /* FIELD SEQUENCE               */
    uint16_t            mask;                               /* FIELD MASK                   */
    uint8_t             navigation;                         /* GSA                          */
    uint8_t             status;                             /* RMC                          */
    uint8_t             sv_in_view_sentences;               /* GSV                          */
    uint8_t             sv_in_view_count;                   /* GSV                          */
    uint8_t             sv_in_view_index;                   /* GSV                          */
    uint8_t             sv_used_count;                      /* GSA                          */
    uint32_t            sv_used_mask[3];                    /* GSA                          */
} nmea_context_t;

/************************************************************************************/

#define UBX_MESSAGE_MASK_NAV_DOP                      0x00010000
#define UBX_MESSAGE_MASK_NAV_PVT                      0x00040000
#define UBX_MESSAGE_MASK_NAV_SAT                      0x00080000
#define UBX_MESSAGE_MASK_NAV_TIMEGPS                  0x00100000
#define UBX_MESSAGE_MASK_SOLUTION                     0x00008000

typedef struct _ubx_context_t {
    uint8_t             ck_a;
    uint8_t             ck_b;
    uint16_t            message;
    uint16_t            length;
    uint16_t            week;
    uint32_t            tow;
    uint32_t            itow;
    uint8_t             protocol[2];
    uint8_t             firmware[24];
    uint32_t            llc[5];
    struct {
        uint8_t         supported;
        uint8_t         enabled;
        uint8_t         simultaneous;
    } gnss;
    stm32l0_lptim_timeout_t sleep;
    stm32l0_lptim_timeout_t timeout;
} ubx_context_t;

/************************************************************************************/

#define GNSS_STATE_START              0
#define GNSS_STATE_NMEA_PAYLOAD       1
#define GNSS_STATE_NMEA_CHECKSUM_1    2
#define GNSS_STATE_NMEA_CHECKSUM_2    3
#define GNSS_STATE_NMEA_END_CR        4
#define GNSS_STATE_NMEA_END_LF        5
#define GNSS_STATE_UBX_SYNC_2         6
#define GNSS_STATE_UBX_MESSAGE_1      7
#define GNSS_STATE_UBX_MESSAGE_2      8
#define GNSS_STATE_UBX_LENGTH_1       9
#define GNSS_STATE_UBX_LENGTH_2       10
#define GNSS_STATE_UBX_PAYLOAD        11
#define GNSS_STATE_UBX_CK_A           12
#define GNSS_STATE_UBX_CK_B           13

#define GNSS_INIT_DONE                0
#define GNSS_INIT_UBX_BAUD_RATE       2
#define GNSS_INIT_UBX_INIT_TABLE      3

#define GNSS_RESPONSE_NONE            0
#define GNSS_RESPONSE_ACK             1
#define GNSS_RESPONSE_NACK            2
#define GNSS_RESPONSE_STARTUP         3
#define GNSS_RESPONSE_NMEA_SENTENCE   4
#define GNSS_RESPONSE_UBX_MESSAGE     5

#define GNSS_RX_DATA_SIZE             96
#define GNSS_TX_DATA_SIZE             64 /* UBX SET PERIODIC */
#define GNSS_TX_TABLE_COUNT           8  /* UBX SET PERIODIC */

typedef struct _gnss_device_t {
    uint8_t             mode;
    uint8_t             rate;
    uint8_t             state;
    volatile uint8_t    init;
    volatile uint8_t    busy;
    volatile uint8_t    wakeup;
    uint32_t            seen;
    uint32_t            expected;
    uint16_t            checksum;
    uint16_t            rx_count;
    uint16_t            rx_offset;
    uint16_t            rx_chunk;
    const uint8_t * const * volatile table;
    uint8_t             rx_data[GNSS_RX_DATA_SIZE];
    uint8_t             tx_data[GNSS_TX_DATA_SIZE];
    const uint8_t       *tx_table[GNSS_TX_TABLE_COUNT];
    nmea_context_t      nmea;
    ubx_context_t       ubx;
    gnss_location_t     location;
    gnss_satellites_t   satellites;
    volatile uint32_t   command;
    volatile uint32_t   pps_sequence[2];
    stm32l0_rtc_capture_t pps_capture;
    int8_t              pps_correction;
    uint8_t             pps_resolved;
    gnss_send_routine_t send_routine;
    const gnss_callbacks_t *callbacks;
    void                *context;
} gnss_device_t;

static gnss_device_t gnss_device;

static void gnss_send_callback(void);
static void ubx_timeout(void);
static void ubx_sleep(void);
static void ubx_wakeup(gnss_device_t *device);
static void ubx_configure(gnss_device_t *device, unsigned int response, uint32_t command);

/************************************************************************************/

#define max(a, b) (((a) > (b)) ? (a) : (b))

static void gnss_location(gnss_device_t *device)
{
    uint64_t clock;
    uint32_t seconds, ticks;
    stm32l0_rtc_tod_t tod;

    switch (device->location.type) {
    case GNSS_LOCATION_TYPE_NONE:
        device->location.mask = 0;
        device->location.numsv = 0;
        device->location.quality = GNSS_LOCATION_QUALITY_NONE;
        break;

    case GNSS_LOCATION_TYPE_TIME:
        device->location.mask &= (GNSS_LOCATION_MASK_TIME |
                                  GNSS_LOCATION_MASK_CORRECTION |
                                  GNSS_LOCATION_MASK_RESOLVED);

        device->location.quality = GNSS_LOCATION_QUALITY_NONE;
        break;

    case GNSS_LOCATION_TYPE_2D:
        device->location.mask &= (GNSS_LOCATION_MASK_TIME |
                                  GNSS_LOCATION_MASK_CORRECTION |
                                  GNSS_LOCATION_MASK_RESOLVED |
                                  GNSS_LOCATION_MASK_POSITION |
                                  GNSS_LOCATION_MASK_SPEED |
                                  GNSS_LOCATION_MASK_COURSE |
                                  GNSS_LOCATION_MASK_EHPE |
                                  GNSS_LOCATION_MASK_HDOP);
        break;

