GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    case GNSS_LOCATION_TYPE_3D:
        break;

    default:
        break;
    }

    if (device->location.mask & GNSS_LOCATION_MASK_TIME)
    {
        if (!(device->location.mask & GNSS_LOCATION_MASK_CORRECTION))
        {
            device->location.correction = -128;

            device->location.mask &= ~GNSS_LOCATION_MASK_RESOLVED;
        }

        if (device->location.time.millis == 0)
        {
            if (device->pps_sequence[1] != device->pps_sequence[0])
            {
		if (device->location.mask & GNSS_LOCATION_MASK_RESOLVED)
		{
		    if ((device->pps_correction != device->location.correction) || !(stm32l0_rtc_status() & STM32L0_RTC_STATUS_UTC_OFFSET_EXTERNAL))
		    {
			stm32l0_rtc_set_utc_offset(device->location.correction, true);
		    }
		    
		    device->pps_correction = device->location.correction;
		    device->pps_resolved = 1;
                }

                do
                {
                    device->pps_sequence[1] = device->pps_sequence[0];

                    clock = stm32l0_rtc_clock_convert(&device->pps_capture);
                }
                while (device->pps_sequence[1] != device->pps_sequence[0]);

                tod.year = (device->location.time.year + 1980) - 1980;
                tod.month = device->location.time.month;
                tod.day = device->location.time.day;
                tod.hours = device->location.time.hours;
                tod.minutes = device->location.time.minutes;
                tod.seconds = device->location.time.seconds;
                tod.ticks = 0;

		stm32l0_rtc_tod_to_time(&tod, &seconds, &ticks);

		stm32l0_rtc_time_write(clock, seconds - 432000 + device->pps_correction, ticks, true);
            }
        }
    }
    else
    {
        device->pps_sequence[1] = device->pps_sequence[0];

        device->location.time.year    = 1980 - 1980;
        device->location.time.month   = 1;
        device->location.time.day     = 6;
        device->location.time.hours   = 0;
        device->location.time.minutes = 0;
        device->location.time.seconds = 0;
        device->location.time.millis  = 0;
        device->location.correction   = -128;

        device->location.mask = 0;
        device->location.numsv = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_POSITION))
    {
        device->location.latitude = 0;
        device->location.longitude = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_ALTITUDE))
    {
        device->location.altitude = 0;
        device->location.separation = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_SPEED))
    {
        device->location.speed = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_COURSE))
    {
        device->location.course = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_CLIMB))
    {
        device->location.climb = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_EHPE))
    {
        device->location.ehpe = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_EVPE))
    {
        device->location.evpe = 0;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_PDOP))
    {
        device->location.pdop = 9999;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_HDOP))
    {
        device->location.hdop = 9999;
    }

    if (!(device->location.mask & GNSS_LOCATION_MASK_VDOP))
    {
        device->location.vdop = 9999;
    }

    if (device->callbacks->location_callback)
    {
        (*device->callbacks->location_callback)(device->context, &device->location);
    }

    device->location.type = 0;
    device->location.mask = 0;
}

static void gnss_satellites(gnss_device_t *device)
{
    if (device->satellites.count > GNSS_SATELLITES_COUNT_MAX)
    {
        device->satellites.count = GNSS_SATELLITES_COUNT_MAX;
    }

    if (device->callbacks->satellites_callback)
    {
        (*device->callbacks->satellites_callback)(device->context, &device->satellites);
    }
}

/************************************************************************************/

static const char nmea_hex_ascii[] = "0123456789ABCDEF";

static uint32_t nmea_isqrt(uint32_t n)
{  
    uint32_t c = 0x8000;  
    uint32_t g = 0x8000;  
  
    while (1)
    {  
        if((g*g) > n) 
        {
            g ^= c;  
        }


        c >>= 1;  
        
        if(c == 0)  
        {
            return g;  
        }

        g |= c;  
    }  
}  

static const uint32_t nmea_scale[10] = {
    1,
    10,
    100,
    1000,
    10000,
    100000,
    1000000,
    10000000,
    100000000,
    1000000000,
};

static int nmea_same_time(const utc_time_t *t0, const utc_time_t *t1)
{
    return ((t0->hours   == t1->hours) &&
            (t0->minutes == t1->minutes) &&
            (t0->seconds == t1->seconds) &&
            (t0->millis  == t1->millis));
}

static int nmea_parse_time(const uint8_t *data, utc_time_t *p_time)
{
    uint32_t hours, minutes, seconds, millis, digits;

    if ((data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
    {
        hours = (data[0] - '0') * 10 + (data[1] - '0');
        data += 2;
        
        if ((hours < 24) && (data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
        {
            minutes = (data[0] - '0') * 10 + (data[1] - '0');
            data += 2;
            
            if ((minutes < 60) && (data[0] >= '0') && (data[0] <= '9') && (data[1] >= '0') && (data[1] <= '9'))
            {
                seconds = (data[0] - '0') * 10 + (data[1] - '0');
                data += 2;
                
                /* A 60 is legal here for leap seconds.
                 */
                if (seconds <= 60)
                {
                    millis = 0;
                    
                    if (data[0] == '.')
                    {
                        digits = 0;
                        data++;
                        
                        while ((data[0] >= '0') && (data[0] <= '9'))
                        {
                            if (digits < 3)
                            {
                                millis = millis * 10 + (data[0] - '0');
                                digits++;
                            }
                            data++;
                        }
                        
                        if (data[0] == '\0')
                        {
                            if (digits < 3)
                            {
                                millis = millis * nmea_scale[3 - digits];
                            }
                        }
                    }
                    
                    if (data[0] == '\0')
                    {
                        p_time->hours   = hours;
                        p_time->minutes = minutes;
                        p_time->seconds = seconds;
                        p_time->millis  = millis;

                        return 1;
                    }
                }
            }
        }
    }

