GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
                context->mask = (NMEA_FIELD_MASK_POSITION |
                                 NMEA_FIELD_MASK_ALTITUDE |
                                 NMEA_FIELD_MASK_HDOP);
                    
                context->sv_in_view_sentences = 0;
                        
                context->sv_used_count = 0;
                context->sv_used_mask[0] = 0;
                context->sv_used_mask[1] = 0;
                context->sv_used_mask[2] = 0;
                        
                device->satellites.count = 0;
            }

            else if (!strcmp((const char*)(data+2), "GST"))
            {
                sequence_next = NMEA_FIELD_SEQUENCE_GST_TIME;
                        
                device->seen &= ~(NMEA_SENTENCE_MASK_GPGST | NMEA_SENTENCE_MASK_SOLUTION);
                        
                context->mask = (NMEA_FIELD_MASK_EHPE |
                                 NMEA_FIELD_MASK_EVPE);
            }

            else if (!strcmp((const char*)(data+2), "RMC"))
            {
                sequence_next = NMEA_FIELD_SEQUENCE_RMC_TIME;
                        
                device->seen &= ~(NMEA_SENTENCE_MASK_GPRMC | NMEA_SENTENCE_MASK_SOLUTION);
                        
                context->mask = (NMEA_FIELD_MASK_TIME |
                                 NMEA_FIELD_MASK_SPEED |
                                 NMEA_FIELD_MASK_COURSE);
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_SKIP:
        sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        break;

    case NMEA_FIELD_SEQUENCE_GGA_TIME:
    case NMEA_FIELD_SEQUENCE_GST_TIME:
    case NMEA_FIELD_SEQUENCE_RMC_TIME:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_TIME;
        }
        else if (nmea_parse_time(data, &time))
        {
            /* If there is a valid time stamp, and another sentence with a time stamp already been seen,
             * make sure they have the same time. If not nuke the accumulated sentences.
             */

            if (device->seen & (NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGST | NMEA_SENTENCE_MASK_GPRMC))
            {
                if (!nmea_same_time(&device->location.time, &time))
                {
                    device->seen = 0;
                    device->location.type = 0;
                    device->location.mask = 0;
                }
            }

            device->location.time.hours   = time.hours;
            device->location.time.minutes = time.minutes;
            device->location.time.seconds = time.seconds;
            device->location.time.millis  = time.millis;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_LATITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_POSITION;
        }
        else if (nmea_parse_latitude(data, &latitude))
        {
            device->location.latitude = latitude;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_LATITUDE_NS:
        if (context->mask & NMEA_FIELD_MASK_POSITION)
        {
            if (data[0] == 'S')
            {
                device->location.latitude = - device->location.latitude;
            }
            else if (data[0] != 'N')
            {
                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_LONGITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_POSITION;
        }
        else if (nmea_parse_longitude(data, &longitude))
        {
            device->location.longitude = longitude;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_LONGITUDE_EW:
        if (context->mask & NMEA_FIELD_MASK_POSITION)
        {
            if (data[0] == 'W')
            {
                device->location.longitude = - device->location.longitude;
            }
            else if (data[0] != 'E')
            {
                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_QUALITY:
        if ((data[0] == '\0') || !nmea_parse_unsigned(data, &quality))
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        else
        {
            device->location.quality = quality;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_HDOP:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_HDOP;
        }
        else if (nmea_parse_fixed(data, &hdop, 2))
        {
            device->location.hdop = hdop;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_ALTITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_ALTITUDE;
        }
        else if (nmea_parse_fixed(((data[0] == '-') ? data+1 : data), &altitude, 3))
        {
            if (data[0] == '-')
            {
                device->location.altitude = -altitude;
            }
            else
            {
                device->location.altitude = altitude;
            }
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_ALTITUDE_UNIT:
        if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
        {
            if (data[0] != 'M')
            {
                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_SEPARATION:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_ALTITUDE;
        }
        else if (nmea_parse_fixed(((data[0] == '-') ? data+1 : data), &separation, 3))
        {
            if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
            {
                if (data[0] == '-')
                {
                    device->location.separation = -separation;
                }
                else
                {
                    device->location.separation = separation;
                }
            }
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

