GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    case NMEA_FIELD_SEQUENCE_GGA_SEPARATION_UNIT:
        if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
        {
            if (data[0] != 'M')
            {
                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GGA_NUMSV:
    case NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_AGE:
    case NMEA_FIELD_SEQUENCE_GSA_OPERATION:
    case NMEA_FIELD_SEQUENCE_GSA_HDOP:
    case NMEA_FIELD_SEQUENCE_GST_RANGE:
    case NMEA_FIELD_SEQUENCE_GST_STDDEV_MAJOR:
    case NMEA_FIELD_SEQUENCE_GST_STDDEV_MINOR:
    case NMEA_FIELD_SEQUENCE_GST_ORIENTATION:
    case NMEA_FIELD_SEQUENCE_RMC_LATITUDE:
    case NMEA_FIELD_SEQUENCE_RMC_LATITUDE_NS:
    case NMEA_FIELD_SEQUENCE_RMC_LONGITUDE:
    case NMEA_FIELD_SEQUENCE_RMC_LONGITUDE_EW:
    case NMEA_FIELD_SEQUENCE_RMC_VARIATION:
    case NMEA_FIELD_SEQUENCE_RMC_VARIATION_UNIT:
        /* SKIP FIELD */
        break;

    case NMEA_FIELD_SEQUENCE_GGA_DIFFERENTIAL_STATION:
        /* SKIP FIELD */
        sequence_next = NMEA_FIELD_SEQUENCE_GGA_END;
        break;

    case NMEA_FIELD_SEQUENCE_GSA_NAVIGATION:
        if (data[0] == '1')
        {
            context->navigation = NMEA_NAVIGATION_NONE;
        }
        else if (data[0] == '2')
        {
            context->navigation = NMEA_NAVIGATION_2D;
        }
        else if (data[0] == '3')
        {
            context->navigation = NMEA_NAVIGATION_3D;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_1:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_2:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_3:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_4:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_5:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_6:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_7:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_8:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_9:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_10:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_11:
    case NMEA_FIELD_SEQUENCE_GSA_SV_USED_PRN_12:
        if (data[0] != '\0')
        {
            if (nmea_parse_unsigned(data, &svid))
            {
                if ((svid >= 1) && (svid <= 96))
                {
                    context->sv_used_mask[(svid -1) >> 5] |= (1ul << ((svid -1) & 31));
                }
            }
            else
            {
                context->sv_used_count = 0;
                context->sv_used_mask[0] = 0;
                context->sv_used_mask[1] = 0;
                context->sv_used_mask[2] = 0;

                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSA_PDOP:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_PDOP;
        }
        else if (nmea_parse_fixed(data, &pdop, 2))
        {
            device->location.pdop = pdop;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSA_VDOP:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_VDOP;

            sequence_next = NMEA_FIELD_SEQUENCE_GSA_END;
        }
        else if (nmea_parse_fixed(data, &vdop, 2))
        {
            device->location.vdop = vdop;
            
            sequence_next = NMEA_FIELD_SEQUENCE_GSA_END;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GST_STDDEV_LATITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_EHPE;
        }
        else if (nmea_parse_fixed(data, &stddev, 3))
        {
            device->location.ehpe = stddev;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GST_STDDEV_LONGITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_EHPE;
        }
        else if (nmea_parse_fixed(data, &stddev, 3))
        {
            device->location.ehpe = nmea_isqrt((device->location.ehpe * device->location.ehpe) + (stddev * stddev));
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GST_STDDEV_ALTITUDE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_EVPE;

            sequence_next = NMEA_FIELD_SEQUENCE_GST_END;
        }
        else if (nmea_parse_fixed(data, &stddev, 3))
        {
            device->location.evpe = stddev;
            
            sequence_next = NMEA_FIELD_SEQUENCE_GST_END;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_SENTENCES:
        if ((data[0] == '\0') || !nmea_parse_unsigned(data, &sentences))
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        else
        {
            if (context->sv_in_view_sentences == 0)
            {
                context->sv_in_view_sentences = sentences;
                context->sv_in_view_count = 0;
                context->sv_in_view_index = 0;
            }
            else
            {
                if (context->sv_in_view_sentences != sentences)
                {
                    context->sv_in_view_sentences = 0;

                    sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
                }
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_CURRENT:
        if ((data[0] == '\0') || !nmea_parse_unsigned(data, &current))
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        else
        {
            if (context->sv_in_view_index != ((current -1) << 2))
            {
                context->sv_in_view_sentences = 0;

                sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_COUNT:
        if ((data[0] == '\0') || !nmea_parse_unsigned(data, &count))
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        else
        {
            context->sv_in_view_count = count;

            if (count == 0)
            {
                sequence_next = NMEA_FIELD_SEQUENCE_GSV_END;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ID:
        svid = 255;

        if ((data[0] == '\0') || nmea_parse_unsigned(data, &svid))
        {
            if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
            {
                device->satellites.info[device->satellites.count].svid = svid;
                device->satellites.info[device->satellites.count].state = 0;
                device->satellites.info[device->satellites.count].snr = 0;
                device->satellites.info[device->satellites.count].elevation = 0;
                device->satellites.info[device->satellites.count].azimuth = 0;
            }
        }
        else
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ELEV:
        elevation = 0;

        if ((data[0] == '\0') || nmea_parse_unsigned(data, &elevation))
        {
            if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
            {
                device->satellites.info[device->satellites.count].elevation = elevation;
            }
        }
        else
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_AZIM:
        azimuth = 0;

        if ((data[0] == '\0') || nmea_parse_unsigned(data, &azimuth))
        {
            if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
            {
                device->satellites.info[device->satellites.count].azimuth = azimuth;
            }
        }
        else
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

