GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    case NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_SNR:
        if ((data[0] == '\0') || nmea_parse_unsigned(data, &snr))
        {
            if (device->satellites.count < GNSS_SATELLITES_COUNT_MAX)
            {
                if (data[0] != '\0')
                {
                    device->satellites.info[device->satellites.count].snr = snr;
                }
            }

            device->satellites.count++;

            context->sv_in_view_index++;

            if ((context->sv_in_view_index == context->sv_in_view_count) || !(context->sv_in_view_index & 3))
            {
                sequence_next = NMEA_FIELD_SEQUENCE_GSV_END;
            }
            else
            {
                sequence_next = NMEA_FIELD_SEQUENCE_GSV_SV_IN_VIEW_ID;
            }
        }
        else
        {
            context->sv_in_view_sentences = 0;

            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_STATUS:
        if (data[0] == 'A')
        {
            context->status = NMEA_STATUS_DATA_VALID;
        }
        else if (data[0] == 'V')
        {
            context->status = NMEA_STATUS_RECEIVER_WARNING;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_SPEED:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_SPEED;
        }
        else if (nmea_parse_fixed(data, &speed, 3))
        {
            /* Conversion factor from knots to m/s is 1852 / 3600.
             */
            device->location.speed  = (speed * 1852 + 1800) / 3600;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_COURSE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_COURSE;
        }
        else if (nmea_parse_fixed(data, &course, 5))
        {
            device->location.course = course;
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_DATE:
        if (data[0] == '\0')
        {
            context->mask &= ~NMEA_FIELD_MASK_TIME;
        }
        else if (nmea_parse_unsigned(data, &date))
        {
            device->location.time.day   = date / 10000;
            device->location.time.month = (date - device->location.time.day * 10000) / 100;
            device->location.time.year  = (date - device->location.time.day * 10000 - device->location.time.month * 100);
            
            if (device->location.time.year < 80)
            {
                device->location.time.year = (2000 + device->location.time.year) - 1980;
            }
            else
            {
                device->location.time.year = (1900 + device->location.time.year) - 1980;
            }
        }
        else
        {
            sequence_next = NMEA_FIELD_SEQUENCE_SKIP;
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_MODE:
        /* SKIP FIELD */
        sequence_next = NMEA_FIELD_SEQUENCE_RMC_END;
        break;
    }

    context->sequence = sequence_next;
}

static void nmea_end_sentence(gnss_device_t *device)
{
    nmea_context_t *context = &device->nmea;
    uint32_t expected;
    uint32_t n, svid;

    switch (context->sequence) {

    case NMEA_FIELD_SEQUENCE_GGA_END:
      if (context->mask & NMEA_FIELD_MASK_POSITION)
        {
            device->location.mask |= GNSS_LOCATION_MASK_POSITION;
        }

        if (context->mask & NMEA_FIELD_MASK_ALTITUDE)
        {
            device->location.mask |= GNSS_LOCATION_MASK_ALTITUDE;
        }

        if (context->mask & NMEA_FIELD_MASK_HDOP)
        {
            device->location.mask |= GNSS_LOCATION_MASK_HDOP;
        }
        
        device->seen |= NMEA_SENTENCE_MASK_GPGGA;
        device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
        break;

    case NMEA_FIELD_SEQUENCE_GSA_END:
        if (context->mask & NMEA_FIELD_MASK_PDOP)
        {
            device->location.mask |= GNSS_LOCATION_MASK_PDOP;
        }

        if (context->mask & NMEA_FIELD_MASK_VDOP)
        {
            device->location.mask |= GNSS_LOCATION_MASK_VDOP;
        }

        /* If the talkes is "GN", then it's a composite fix, which will consist out
         * of GNGSA, GNGSA, GPGSV & GLGSV. Otherwise only a GPGSA & GPGSV is to be
         * expected.
         */

        if (context->prefix == 'N')
        {
            device->expected |= (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);
            
            if (!(device->seen & NMEA_SENTENCE_MASK_GPGSA))
            {
                device->seen |= NMEA_SENTENCE_MASK_GPGSA;
            }
            else
            {
                device->seen |= NMEA_SENTENCE_MASK_GLGSA;
                device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
            }
        }
        else if (context->prefix == 'L')
        {
            device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV)) | (NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV);

            device->seen |= NMEA_SENTENCE_MASK_GLGSA;
            device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
        }
        else
        {
            device->expected = (device->expected & ~(NMEA_SENTENCE_MASK_GLGSA | NMEA_SENTENCE_MASK_GLGSV)) | (NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV);

            device->seen |= NMEA_SENTENCE_MASK_GPGSA;
            device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
        }
        break;

    case NMEA_FIELD_SEQUENCE_GST_END:
        device->expected |= NMEA_SENTENCE_MASK_GPGST;

        if (context->mask & NMEA_FIELD_MASK_EHPE)
        {
            device->location.mask |= GNSS_LOCATION_MASK_EHPE;
        }

        if (context->mask & NMEA_FIELD_MASK_EVPE)
        {
            device->location.mask |= GNSS_LOCATION_MASK_EVPE;
        }

        device->seen |= NMEA_SENTENCE_MASK_GPGST;
        device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
        break;

    case NMEA_FIELD_SEQUENCE_GSV_END:
        if (context->sv_in_view_count == context->sv_in_view_index)
        {
            context->sv_in_view_sentences = 0;

