GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
            if (context->prefix == 'P')
            {
                device->seen |= NMEA_SENTENCE_MASK_GPGSV;
            }

            if (context->prefix == 'L')
            {
                device->seen |= NMEA_SENTENCE_MASK_GLGSV;
            }
        }
        break;

    case NMEA_FIELD_SEQUENCE_RMC_END:
        if (context->mask & NMEA_FIELD_MASK_TIME)
        {
            device->location.mask |= GNSS_LOCATION_MASK_TIME;
        }

        if (context->mask & NMEA_FIELD_MASK_SPEED)
        {
            device->location.mask |= GNSS_LOCATION_MASK_SPEED;
        }

        if (context->mask & NMEA_FIELD_MASK_COURSE)
        {
            device->location.mask |= GNSS_LOCATION_MASK_COURSE;
        }

        device->seen |= NMEA_SENTENCE_MASK_GPRMC;
        device->seen &= ~NMEA_SENTENCE_MASK_SOLUTION;
        break;

    default:
        break;
    }

    context->sequence = NMEA_FIELD_SEQUENCE_START;

    if (device->init == GNSS_INIT_DONE)
    {
        expected = device->expected & (NMEA_SENTENCE_MASK_GPGGA |
                                       NMEA_SENTENCE_MASK_GPGSA |
                                       NMEA_SENTENCE_MASK_GPGST |
                                       NMEA_SENTENCE_MASK_GPRMC |
                                       NMEA_SENTENCE_MASK_GLGSA);
        
        if (expected && ((device->seen & expected) == expected))
        {
            if ((context->status == NMEA_STATUS_DATA_VALID) && (context->navigation != NMEA_NAVIGATION_NONE))
            {
                device->location.type = (context->navigation == NMEA_NAVIGATION_2D) ? GNSS_LOCATION_TYPE_2D : GNSS_LOCATION_TYPE_3D;
                device->location.numsv = context->sv_used_count;
            }
            else
            {
                device->location.type = GNSS_LOCATION_TYPE_NONE;
                device->location.numsv = 0;

                context->sv_used_count   = 0;
                context->sv_used_mask[0] = 0;
                context->sv_used_mask[1] = 0;
                context->sv_used_mask[2] = 0;
            }

            gnss_location(device);
            
            device->seen &= ~(NMEA_SENTENCE_MASK_GPGGA |
                              NMEA_SENTENCE_MASK_GPGSA |
                              NMEA_SENTENCE_MASK_GPGST |
                              NMEA_SENTENCE_MASK_GPRMC |
                              NMEA_SENTENCE_MASK_GLGSA);

            device->seen |= NMEA_SENTENCE_MASK_SOLUTION;
        }
        
        
        expected = device->expected & (NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
        
        if ((device->seen & NMEA_SENTENCE_MASK_SOLUTION) && expected && ((device->seen & expected) == expected))
        {
            for (n = 0; n < device->satellites.count; n++)
            {
                svid = device->satellites.info[n].svid;

                if ((svid >= 1) && (svid <= 96) && (context->sv_used_mask[(svid -1) >> 5] & (1ul << ((svid -1) & 31))))
                {
                    device->satellites.info[n].state |= GNSS_SATELLITES_STATE_NAVIGATING;
                }
            }

            gnss_satellites(device);
            
            device->seen &= ~(NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GLGSV);
        }
    }
}

/************************************************************************************/

#if 0

static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return (int8_t)data[offset];
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return (int16_t)(((uint16_t)data[offset+0] << 0) |
                     ((uint16_t)data[offset+1] << 8));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return (int32_t)(((uint32_t)data[offset+0] <<  0) |
                     ((uint32_t)data[offset+1] <<  8) |
                     ((uint32_t)data[offset+2] << 16) |
                     ((uint32_t)data[offset+3] << 24));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return (uint8_t)data[offset];
}

static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return (uint16_t)(((uint16_t)data[offset+0] << 0) |
                      ((uint16_t)data[offset+1] << 8));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return (uint32_t)(((uint32_t)data[offset+0] <<  0) |
                      ((uint32_t)data[offset+1] <<  8) |
                      ((uint32_t)data[offset+2] << 16) |
                      ((uint32_t)data[offset+3] << 24));
}

#endif


static inline int8_t ubx_data_int8(const uint8_t *data, unsigned int offset)
{
    return *((const int8_t*)((const void*)(&data[offset])));
}

static inline int16_t ubx_data_int16(const uint8_t *data, unsigned int offset)
{
    return *((const int16_t*)((const void*)(&data[offset])));
}

static inline int32_t ubx_data_int32(const uint8_t *data, unsigned int offset)
{
    return *((const int32_t*)((const void*)(&data[offset])));
}

static inline uint8_t ubx_data_uint8(const uint8_t *data, unsigned int offset)
{
    return *((const uint8_t*)((const void*)(&data[offset])));
}

static inline uint16_t ubx_data_uint16(const uint8_t *data, unsigned int offset)
{
    return *((const uint16_t*)((const void*)(&data[offset])));
}

static inline uint32_t ubx_data_uint32(const uint8_t *data, unsigned int offset)
{
    return *((const uint32_t*)((const void*)(&data[offset])));
}

static void ubx_start_message(gnss_device_t *device, unsigned int message)
{
    if (message == 0x0135)
    {
        /* UBX-NAV-SAT */
            
        device->rx_chunk = 20;
        device->satellites.count = 0;
        
        device->seen &= ~UBX_MESSAGE_MASK_NAV_SAT;
    }

    if (message == 0x0a04)
    {
        /* UBX-MON-VER */
            
        device->rx_chunk = 40;

	stm32l0_lptim_timeout_stop(&device->ubx.timeout);
    }
}

static void ubx_parse_message(gnss_device_t *device, unsigned int message, uint8_t *data)
{
    unsigned int gnss, svid;

