GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    if (message == 0x0135)
    {
        /* UBX-NAV-SVAT */

        gnss = ubx_data_uint8(data, 8);
        svid = ubx_data_uint8(data, 9);

        if (gnss == 0)
        {
            /* GPS */
        }
        else if (gnss == 1)
        {
            /* SBAS */
        }
        else if (gnss == 2)
        {
            /* GALILEO */
            svid += 210;
        }
        else if (gnss == 4)
        {
            /* IMES */
            svid += 172;
        }
        else if (gnss == 5)
        {
            /* QZSS */
            svid += 192;
        }
        else if (gnss == 6)
        {
            if (svid != 255)
            {
                svid += 64;
            }
        }
        else
        {
            svid = 0;
        }

        if (svid && (device->satellites.count < GNSS_SATELLITES_COUNT_MAX))
        {
            device->satellites.info[device->satellites.count].svid = svid;

            device->satellites.info[device->satellites.count].snr = ubx_data_uint8(data, 10);

            if (ubx_data_int8(data, 11) > 0)
            {
                device->satellites.info[device->satellites.count].elevation = ubx_data_int8(data, 11);
                device->satellites.info[device->satellites.count].azimuth = ubx_data_int16(data, 12);
            }
            else
            {
                device->satellites.info[device->satellites.count].elevation = 0;
                device->satellites.info[device->satellites.count].azimuth = 0;
            }

            if (ubx_data_uint8(data, 16) & 0x20)
            {
                device->satellites.info[device->satellites.count].state = GNSS_SATELLITES_STATE_UNHEALTHY;
            }
            else
            {
                device->satellites.info[device->satellites.count].state = 0;

                if (ubx_data_uint8(data, 17) & 0x10)
                {
                    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_ALMANAC;
                }
                
                if (ubx_data_uint8(data, 17) & 0x08)
                {
                    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_EPHEMERIS;
                }

                if (ubx_data_uint8(data, 16) & 0x40)
                {
                    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_CORRECTION;
                }
                
                if (ubx_data_uint8(data, 17) & 0x40)
                {
                    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_AUTONOMOUS;
                }

                switch (ubx_data_uint8(data, 16) & 0x07) {
                case 0x00: /* NO SIGNAL */
                case 0x01: /* SEARCHING */ 
                    break;
                case 0x02: /* SIGNAL ACQUIRED */
                case 0x03: /* SIGNAL ACQUIRED, BUT UNUSABLE */
                    device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_ACQUIRED;
                    break;
                    
                case 0x04: /* SIGNAL ACQUIRED, CODE LOCKED */
                case 0x05: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
                case 0x06: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
                case 0x07: /* SIGNAL ACQUIRED, CODE LOCKED, CARRIER LOCKED */
                    device->satellites.info[device->satellites.count].state |= (GNSS_SATELLITES_STATE_ACQUIRED | GNSS_SATELLITES_STATE_LOCKED);

                    if (ubx_data_uint8(data, 16) & 0x08)
                    {
                        device->satellites.info[device->satellites.count].state |= GNSS_SATELLITES_STATE_NAVIGATING;
                    }
                    break;
                    
                default:
                    break;
                }
            }

            device->satellites.count++;
        }
        
        device->rx_offset += 12;
        device->rx_chunk += 12;
    }

    if (message == 0x0a04)
    {
        /* UBX-MON-VER */

	// printf("STRING \"%s\"\n\r", data);

	if (!strncmp((const char*)data, "PROTVER=", 8))
	{
	    device->ubx.protocol[0] = (data[8] - 0x30) * 10 + (data[9] - 0x30);
	    device->ubx.protocol[1] = (data[11] - 0x30) * 10 + (data[12] - 0x30);
	}

	if (!strncmp((const char*)data, "FWVER=", 6))
	{
	    memcpy(&device->ubx.firmware[0], &data[6], 24);
	}
	
	if (device->rx_offset == 0)
	{
	    device->rx_offset += 40;
	    device->rx_chunk += 30;
	}
	else
	{
	    device->rx_offset += 30;
	    device->rx_chunk += 30;
	}
    }
}

static void ubx_end_message(gnss_device_t *device, unsigned int message, uint8_t *data)
{
    ubx_context_t *context = &device->ubx;
    unsigned int expected;
    uint16_t week, command;
    int32_t tow;

    // printf("MESSAGE %04x\r\n", message);

    if ((message >> 8) == 0x01)
    {
        if (device->seen & (UBX_MESSAGE_MASK_NAV_DOP |
                            UBX_MESSAGE_MASK_NAV_PVT |
                            UBX_MESSAGE_MASK_NAV_SAT |
                            UBX_MESSAGE_MASK_NAV_TIMEGPS |
                            UBX_MESSAGE_MASK_SOLUTION))
        {
            if (context->itow != ubx_data_uint32(data, 0))
            {
                device->seen = 0;
                device->location.type = 0;
                device->location.mask = 0;
            }
        }
        
        context->itow = ubx_data_uint32(data, 0);

        switch (message & 0xff) {

        case 0x04:
            /* UBX-NAV-DOP */

            device->location.pdop = ubx_data_uint16(data, 6);
            device->location.hdop = ubx_data_uint16(data, 12);
            device->location.vdop = ubx_data_uint16(data, 10);

            device->location.mask |= (GNSS_LOCATION_MASK_PDOP |
                                      GNSS_LOCATION_MASK_HDOP |
                                      GNSS_LOCATION_MASK_VDOP);

            device->seen |= UBX_MESSAGE_MASK_NAV_DOP;
            break;

        case 0x07:
            /* UBX-NAV-PVT */

            if ((ubx_data_uint8(data, 11) & 0x03) == 0x03)
            {
                device->location.time.year = ubx_data_uint16(data, 4) - 1980;
                device->location.time.month = ubx_data_uint8(data, 6);
                device->location.time.day = ubx_data_uint8(data, 7);
                device->location.time.hours = ubx_data_uint8(data, 8);
                device->location.time.minutes = ubx_data_uint8(data, 9);
                device->location.time.seconds = ubx_data_uint8(data, 10);

