GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
                if (ubx_data_int32(data, 16) > 0)
                {
                    device->location.time.millis = ((ubx_data_int32(data, 16) + 500000) / 1000000);
                }
                else
                {
                    device->location.time.millis = 0;
                }

                device->location.mask |= GNSS_LOCATION_MASK_TIME;
            }
            else
            {
                device->location.time.year = 1980 - 1980;
                device->location.time.month = 1;
                device->location.time.day = 6;
                device->location.time.hours = 0;
                device->location.time.minutes = 0;
                device->location.time.seconds = 0;
                device->location.time.millis = 0;
            }

            device->location.latitude = ubx_data_int32(data, 28);
            device->location.longitude = ubx_data_int32(data, 24);
            device->location.altitude = ubx_data_int32(data, 36);
            device->location.separation = ubx_data_int32(data, 32) - ubx_data_int32(data, 36);
            device->location.speed = ubx_data_int32(data, 60);
            device->location.course = ubx_data_int32(data, 64);
            device->location.climb = - ubx_data_int32(data, 56);
            device->location.ehpe = ubx_data_uint32(data, 40);
            device->location.evpe = ubx_data_uint32(data, 44);

            switch (ubx_data_uint8(data, 20)) {
            case 0x00:
                device->location.type = GNSS_LOCATION_TYPE_NONE;
                device->location.quality = GNSS_LOCATION_QUALITY_NONE;
                break;

            case 0x01:
                device->location.type = GNSS_LOCATION_TYPE_NONE;
                device->location.quality = GNSS_LOCATION_QUALITY_ESTIMATED;
                break;

            case 0x02:
                device->location.type = GNSS_LOCATION_TYPE_2D;

                if (ubx_data_uint8(data, 21) & 0xc0)
                {
                    device->location.quality = ((ubx_data_uint8(data, 21) & 0x80) ? GNSS_LOCATION_QUALITY_RTK_FIXED : GNSS_LOCATION_QUALITY_RTK_FLOAT);
                }
                else if (ubx_data_uint8(data, 21) & 0x01)
                {
                    device->location.quality = ((ubx_data_uint8(data, 21) & 0x02) ? GNSS_LOCATION_QUALITY_DIFFERENTIAL : GNSS_LOCATION_QUALITY_AUTONOMOUS);
                }
                else
                {
                    device->location.quality = GNSS_LOCATION_QUALITY_NONE;
                }
                break;

            case 0x03:
                device->location.type = GNSS_LOCATION_TYPE_3D;

                if (ubx_data_uint8(data, 21) & 0xc0)
                {
                    device->location.quality = ((ubx_data_uint8(data, 21) & 0x80) ? GNSS_LOCATION_QUALITY_RTK_FIXED : GNSS_LOCATION_QUALITY_RTK_FLOAT);
                }
                else if (ubx_data_uint8(data, 21) & 0x01)
                {
                    device->location.quality = ((ubx_data_uint8(data, 21) & 0x02) ? GNSS_LOCATION_QUALITY_DIFFERENTIAL : GNSS_LOCATION_QUALITY_AUTONOMOUS);
                }
                else
                {
                    device->location.quality = GNSS_LOCATION_QUALITY_NONE;
                }
                break;

            case 0x04:
                device->location.type = GNSS_LOCATION_TYPE_2D;
                device->location.quality = GNSS_LOCATION_QUALITY_ESTIMATED;
                break;

            case 0x05:
                device->location.type = GNSS_LOCATION_TYPE_TIME;
                device->location.quality = GNSS_LOCATION_QUALITY_NONE;
                break;
            }

            device->location.numsv = ubx_data_uint8(data, 23);

            device->location.mask |= (GNSS_LOCATION_MASK_POSITION |
                                      GNSS_LOCATION_MASK_ALTITUDE |
                                      GNSS_LOCATION_MASK_SPEED |
                                      GNSS_LOCATION_MASK_COURSE |
                                      GNSS_LOCATION_MASK_CLIMB |
                                      GNSS_LOCATION_MASK_EHPE |
                                      GNSS_LOCATION_MASK_EVPE);

            device->seen |= UBX_MESSAGE_MASK_NAV_PVT;
            device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
            break;

        case 0x20:
            /* UBX-NAV-TIMEGPS */

            if ((ubx_data_uint8(data, 11) & 0x03) == 0x03)
            {
                tow  = ubx_data_uint32(data, 0) + (ubx_data_int32(data, 4) + 500000) / 1000000;
                week = ubx_data_uint16(data, 8);

                if (tow < 0)
                {
                    tow += 604800000;
                    week -= 1;
                }
                
                if (tow >= 604800000)
                {
                    tow -= 604800000;
                    week += 1;
                }

                context->week = week;
                context->tow = tow;
                
                device->location.correction = ubx_data_int8(data, 10);

                device->location.mask |= GNSS_LOCATION_MASK_CORRECTION;

                if (ubx_data_uint8(data, 11) & 0x04)
                {
                    device->location.mask |= GNSS_LOCATION_MASK_RESOLVED;
                }
            }
            else
            {
                context->week = 0;
                context->tow = 0;

                device->location.correction = -128;
            }

            device->seen |= UBX_MESSAGE_MASK_NAV_TIMEGPS;
            device->seen &= ~UBX_MESSAGE_MASK_SOLUTION;
            break;

        case 0x35:
            /* UBX-NAV-SAT */

            device->seen |= UBX_MESSAGE_MASK_NAV_SAT;
            break;

        default:
            break;
        }
    }

    else if (message == 0x0500)
    {
        /* UBX-ACK-NACK */
        command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

        // printf("NACK %04x\r\n", command);

        if (command == device->command)
        {
            device->command = ~0l;
            
            ubx_configure(device, GNSS_RESPONSE_NACK, command);
        }
    }

    else if (message == 0x0501)
    {
        /* UBX-ACK-ACK */
        command = ((ubx_data_uint8(data, 0) << 8) | ubx_data_uint8(data, 1));

        // printf("ACK %04x\r\n", command);

        if (command == device->command)
        {
            device->command = ~0l;
            
            ubx_configure(device, GNSS_RESPONSE_ACK, command);
        }
    }

    else if (message == 0x0a04)
    {
        // printf("RESPONSE %04x\r\n", message);
	
        if (message == device->command)
        {
            device->command = ~0l;
            
            ubx_configure(device, GNSS_RESPONSE_ACK, message);
        }
    }
    
    else if (message == 0x0a0d)
    {
        // printf("RESPONSE %04x\r\n", message);

