GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
        /* UBX-NON-LLC */
	device->ubx.llc[0] = ubx_data_uint32(data, 0);
	device->ubx.llc[1] = ubx_data_uint32(data, 4);
	device->ubx.llc[2] = ubx_data_uint32(data, 8);
	device->ubx.llc[3] = ubx_data_uint32(data, 16);
	device->ubx.llc[4] = ubx_data_uint32(data, 20);
	
        if (message == device->command)
        {
            device->command = ~0l;
            
            ubx_configure(device, GNSS_RESPONSE_ACK, message);
        }
    }
    
    else if (message == 0x0a28)
    {
        // printf("RESPONSE %04x\r\n", message);

        /* UBX-NON-GNSS */
        device->ubx.gnss.supported = ubx_data_uint8(data, 1);
        device->ubx.gnss.enabled = ubx_data_uint8(data, 3);
        device->ubx.gnss.simultaneous = ubx_data_uint8(data, 4);

        if (message == device->command)
        {
            device->command = ~0l;
            
            ubx_configure(device, GNSS_RESPONSE_ACK, message);
        }
    }

    if (device->init == GNSS_INIT_DONE)
    {
        expected = device->expected & (UBX_MESSAGE_MASK_NAV_DOP |
                                       UBX_MESSAGE_MASK_NAV_PVT |
                                       UBX_MESSAGE_MASK_NAV_TIMEGPS);
        
        if (expected && ((device->seen & expected) == expected))
        {
            gnss_location(device);
            
            device->seen &= ~(UBX_MESSAGE_MASK_NAV_DOP |
                              UBX_MESSAGE_MASK_NAV_PVT |
                              UBX_MESSAGE_MASK_NAV_TIMEGPS);
            
            device->seen |= UBX_MESSAGE_MASK_SOLUTION;
        }
        
        expected = device->expected & (UBX_MESSAGE_MASK_NAV_SAT);
        
        if ((device->seen & UBX_MESSAGE_MASK_SOLUTION) && expected && ((device->seen & expected) == expected))
        {
            gnss_satellites(device);
            
            device->seen &= ~(UBX_MESSAGE_MASK_NAV_SAT);
        }
    }
}

static const uint8_t ubx_cfg_msg_nav_pvt[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x07,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x18, 0xe1,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_timegps[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x20,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x31, 0x90,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_dop[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x04,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x15, 0xcc,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_sat_1hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x35,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x01,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x46, 0x23,                                     /* CK_A, CK_B                */
};

static const uint8_t ubx_cfg_msg_nav_sat_5hz[] = {
    0xb5, 0x62,                                     /* SYNC_CHAR_1, SYNC_CHAR_2  */
    0x06, 0x01,                                     /* CLASS, ID                 */
    0x08, 0x00,                                     /* LENGTH                    */
    0x01,                                           /* CLASS                     */
    0x35,                                           /* ID                        */
    0x00,                                           /* RATE DDC                  */
    0x05,                                           /* RATE UART1                */
    0x00,                                           /* RATE UART2                */
    0x00,                                           /* RATE USB                  */
    0x00,                                           /* RATE SPI                  */
    0x00,                                           /*                           */
    0x4a, 0x37,                                     /* CK_A, CK_B                */
};

