GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
static const uint8_t * const ubx_qzss_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_qzss_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_gnss_qzss_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_aop_enable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_aop_enable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_aop_disable_table[] = {
    ubx_cfg_rxm_continuous,
    ubx_cfg_pm2,
    ubx_cfg_aop_disable,
    ubx_cfg_save,
    NULL,
};

static const uint8_t * const ubx_gnss_wakeup_table[] = {
    ubx_cfg_rxm_continuous,
    NULL,
};


static void ubx_checksum(uint8_t *data)
{
    uint8_t ck_a, ck_b;
    unsigned int i, count;

    count = (data[4] | (data[5] << 8)) + 8;

    ck_a = 0;
    ck_b = 0;
    
    for (i = 2; i < (count -2); i++)
    {
        ck_a += data[i];
        ck_b += ck_a;
    }
        
    data[count -2] = ck_a;
    data[count -1] = ck_b;
}

static void ubx_send(gnss_device_t *device, const uint8_t *data)
{
    uint32_t command;
    unsigned int count;

    if (data == ubx_cfg_rxm_continuous)
    {
        command = 0x0611;
        count   = sizeof(ubx_cfg_rxm_continuous);
    }
    else
    {
        command = (data[2] << 8) | data[3];
        count  = (data[4] | (data[5] << 8)) + 8;
    }

    device->command = command;
    device->busy = 1;

    // printf("COMMAND %04x\r\n", command);

    (*device->send_routine)(device->context, data, count, gnss_send_callback);
}

static void ubx_table(gnss_device_t *device, const uint8_t * const * table)
{
    const uint8_t *data;

    data = table[0];
    device->table = table + 1;

    ubx_send(device, data);

    stm32l0_lptim_timeout_start(&device->ubx.timeout, stm32l0_lptim_millis_to_ticks(125), (stm32l0_lptim_callback_t)ubx_timeout); // 125ms
}

static void ubx_configure(gnss_device_t *device, __attribute__((unused)) unsigned int response, uint32_t command)
{
    const uint8_t *data = NULL;

    stm32l0_lptim_timeout_stop(&device->ubx.timeout);

    // printf("CONFIGURE %04x\r\n", command);
    
    if (device->table)
    {
        if (device->init == GNSS_INIT_UBX_BAUD_RATE)
        {
            device->init = GNSS_INIT_UBX_INIT_TABLE;

            device->ubx.protocol[0] = 0;
            device->ubx.protocol[1] = 0;
            device->ubx.gnss.supported = 0;
            device->ubx.gnss.enabled = 0;
            device->ubx.gnss.simultaneous = 0;

            data = device->table[0];
            device->table = device->table + 1;
        }
        else
        {
            if (command == 0x0a28)
            {
		if      (device->rate >= 10) { device->table = ubx_init_ublox_10hz_table; }
		else if (device->rate >=  5) { device->table = ubx_init_ublox_5hz_table;  }
		else                         { device->table = ubx_init_ublox_1hz_table;  }

                data = device->table[0];
                device->table = device->table + 1;
            }
            else
            {
                if (device->table[0] != NULL)
                {
                    data = device->table[0];
                    device->table = device->table + 1;
                }
                else
                {
                    device->table = NULL;

                    if (device->init == GNSS_INIT_UBX_INIT_TABLE)
                    {
                        device->init = GNSS_INIT_DONE;
                
			device->ubx.gnss.enabled = GNSS_CONSTELLATION_GPS;

			device->expected = (UBX_MESSAGE_MASK_NAV_DOP |
					    UBX_MESSAGE_MASK_NAV_PVT |
					    UBX_MESSAGE_MASK_NAV_SAT |
					    UBX_MESSAGE_MASK_NAV_TIMEGPS);
                        
                        device->seen = 0;
                        device->location.type = 0;
                        device->location.mask = 0;
                    }
                }
            }
        }
    }
    
    if (data)
    {
        ubx_send(device, data);

        stm32l0_lptim_timeout_start(&device->ubx.timeout, stm32l0_lptim_millis_to_ticks(125), (stm32l0_lptim_callback_t)ubx_timeout); // 125ms
    }
}

static void ubx_sleep(void)
{
    gnss_device_t *device = &gnss_device;

    if (device->callbacks->disable_callback)
    {
        (*device->callbacks->disable_callback)(device->context);
    }

    device->busy = 0;
}

static void ubx_wakeup(gnss_device_t *device)
{
    uint8_t *data;
    uint32_t seconds, ticks, nanoseconds;
    stm32l0_rtc_tod_t tod;

    if (device->pps_resolved)
    {
	stm32l0_rtc_time_read(&seconds, &ticks);

	stm32l0_rtc_time_to_tod(seconds + 432000 - device->pps_correction, ticks, &tod);

	nanoseconds = (uint64_t)((uint32_t)ticks * (uint32_t)1000000000) / STM32L0_RTC_CLOCK_TICKS_PER_SECOND;

	data = &device->tx_data[0];

	memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
        
	data[ 0] = 0xb5;
	data[ 1] = 0x62;
	data[ 2] = 0x13;
	data[ 3] = 0x40;
	data[ 4] = 0x18;
	data[ 5] = 0x00;
	data[ 6] = 0x10;
	data[ 7] = 0x00;
	data[ 8] = 0x00;
	data[ 9] = device->pps_correction;
	data[10] = (1980 + tod.year) >> 0;
	data[11] = (1980 + tod.year) >> 8;
	data[12] = tod.month;
	data[13] = tod.day;
	data[14] = tod.hours;
	data[15] = tod.minutes;
	data[16] = tod.seconds;
	data[17] = 0;
	data[18] = nanoseconds >> 0;
	data[19] = nanoseconds >> 8;
	data[20] = nanoseconds >> 16;
	data[21] = nanoseconds >> 24;
	data[22] = 0;
	data[23] = 0;
	data[24] = 0;
	data[25] = 0;
	data[26] = 0;
	data[27] = 0;
	data[28] = 0;
	data[29] = 0;
                
	ubx_checksum(data);

	ubx_send(device, data);
    }
}

static void ubx_timeout(void)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t *data = NULL;

    if (device->table)
    {
        data = *(device->table -1);

        ubx_send(device, data);

        stm32l0_lptim_timeout_start(&device->ubx.timeout, stm32l0_lptim_millis_to_ticks(125), (stm32l0_lptim_callback_t)ubx_timeout); // 125ms
    }
}

/************************************************************************************/

static void gnss_send_callback(void)
{
    gnss_device_t *device = &gnss_device;

    if ((device->mode == GNSS_MODE_UBLOX) && (device->command == 0x0604))
    {
        device->command = ~0l;
        
