GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
                if ((device->rx_count - device->rx_offset) < GNSS_RX_DATA_SIZE)
                {
                    device->rx_data[device->rx_count - device->rx_offset] = c;
                }
                
                device->rx_count++;
                
                if (device->rx_count == device->rx_chunk)
                {
                    ubx_parse_message(device, device->ubx.message, &device->rx_data[0]);
                }

                if (device->rx_count == device->ubx.length)
                {
                    device->state = GNSS_STATE_UBX_CK_A;
                }
                break;

            case GNSS_STATE_UBX_CK_A:
                device->ubx.ck_a ^= c;
                device->state = GNSS_STATE_UBX_CK_B;
                break;
                
            case GNSS_STATE_UBX_CK_B:
                device->ubx.ck_b ^= c;

                if ((device->ubx.ck_a == 0x00) &&  (device->ubx.ck_b == 0x00))
                {
                    if (device->init != GNSS_INIT_DONE)
                    {
                        if (device->init == GNSS_INIT_UBX_BAUD_RATE)
                        {
                            ubx_configure(device, GNSS_RESPONSE_UBX_MESSAGE, ~0l);
                        }
                    }

                    if ((device->rx_count - device->rx_offset) <= GNSS_RX_DATA_SIZE)
                    {
                        ubx_end_message(device, device->ubx.message, &device->rx_data[0]);
                    }
                }

                device->state = GNSS_STATE_START;
                break;

            default:
                break;
            }
        }
    }
}

void gnss_initialize(unsigned int mode, unsigned int rate, unsigned int speed, gnss_send_routine_t send_routine, const gnss_callbacks_t *callbacks, void *context)
{
    gnss_device_t *device = &gnss_device;
    const char *uart_data = NULL;
    unsigned int uart_count = 0;

    device->send_routine = send_routine;
    device->callbacks = callbacks;
    device->context = context;

    device->state = GNSS_STATE_START;
    device->busy = 0;
    device->wakeup = 0;
    device->command = -1;

    device->mode = mode;
    device->rate = rate;

    device->pps_sequence[0] = 0;
    device->pps_sequence[1] = 0;
    device->pps_correction = stm32l0_rtc_get_utc_offset();
    device->pps_resolved = 0;
    
    memset(&device->location, 0, sizeof(device->location));
    memset(&device->satellites, 0, sizeof(device->satellites));


    if (mode == GNSS_MODE_UBLOX)
    {
        device->init = GNSS_INIT_UBX_BAUD_RATE;

        device->table = ubx_init_table;

        if (speed >= 115200)
        {
            uart_data = "$PUBX,41,1,0007,0003,115200,0*18\r\n";
        }
        else if (speed >= 57600)
        {
            uart_data = "$PUBX,41,1,0007,0003,57600,0*2B\r\n";
        }
        else if (speed >= 38400)
        {
            uart_data = "$PUBX,41,1,0007,0003,38400,0*20\r\n";
        }
        else if (speed >= 19200)
        {
            uart_data = "$PUBX,41,1,0007,0003,19200,0*25\r\n";
        }
        else
        {
            uart_data = "$PUBX,41,1,0007,0003,9600,0*10\r\n";
        }
        
        uart_count = strlen(uart_data);

        stm32l0_lptim_timeout_create(&device->ubx.sleep);
        stm32l0_lptim_timeout_create(&device->ubx.timeout);
    }
    else
    {
        device->init = GNSS_INIT_DONE;
        device->table = NULL;
        device->expected = NMEA_SENTENCE_MASK_GPGGA | NMEA_SENTENCE_MASK_GPGSA | NMEA_SENTENCE_MASK_GPGSV | NMEA_SENTENCE_MASK_GPRMC;
    }

    if (uart_data)
    {
        (device->send_routine)(device->context, (const uint8_t*)uart_data, uart_count, NULL);
    }
}

bool gnss_set_antenna(unsigned int antenna)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        ubx_table(device, ((antenna == GNSS_ANTENNA_EXTERNAL) ? ubx_ant_external_table : ubx_ant_internal_table));
        break;
    }

    return true;
}

bool gnss_set_pps(unsigned int width)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        if (width > 999) {
            width = 0;
        } else {
            width = 1000000 - width * 1000;
        }

        data = &device->tx_data[0];
        table = &device->tx_table[0];

        memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
        
        data[ 0] = 0xb5;
        data[ 1] = 0x62;
        data[ 2] = 0x06;
        data[ 3] = 0x31;
        data[ 4] = 0x20;
        data[ 5] = 0x00;
        data[ 6] = 0x00;
        data[ 7] = 0x00;
        data[ 8] = 0x00;
        data[ 9] = 0x00;
        data[10] = 0x32;
        data[11] = 0x00;
        data[12] = 0x00;
        data[13] = 0x00;
        data[14] = (uint8_t)(1000000 >> 0);
        data[15] = (uint8_t)(1000000 >> 8);
        data[16] = (uint8_t)(1000000 >> 16);
        data[17] = (uint8_t)(1000000 >> 24);
        data[18] = (uint8_t)(1000000 >> 0);
        data[19] = (uint8_t)(1000000 >> 8);
        data[20] = (uint8_t)(1000000 >> 16);
        data[21] = (uint8_t)(1000000 >> 24);
        data[22] = (uint8_t)(1000000 >> 0);
        data[23] = (uint8_t)(1000000 >> 8);
        data[24] = (uint8_t)(1000000 >> 16);
        data[25] = (uint8_t)(1000000 >> 24);
        data[26] = (uint8_t)(width >> 0);
        data[27] = (uint8_t)(width >> 8);
        data[28] = (uint8_t)(width >> 16);
        data[29] = (uint8_t)(width >> 24);
        data[30] = 0x00;
        data[31] = 0x00;
        data[32] = 0x00;
        data[33] = 0x00;
        data[34] = width ? 0xb7 : 0x00;
        data[35] = 0x00;
        data[36] = 0x00;
        data[37] = 0x00;
        
        ubx_checksum(data);

        table[0] = ubx_cfg_rxm_continuous;
        table[1] = ubx_cfg_pm2;
        table[2] = &data[0];
        table[3] = ubx_cfg_save;
        table[4] = NULL;

        ubx_table(device, table);
    }

