GrumpyOldPizza/ArduinoCore-stm32l0/libraries/GNSS/src/utility/gnss_core.c
    return true;
}

bool gnss_set_constellation(unsigned int mask)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        if (device->ubx.gnss.simultaneous) {
            mask = (mask & device->ubx.gnss.supported) | GNSS_CONSTELLATION_GPS;

            if (device->ubx.gnss.enabled != mask) {
                device->ubx.gnss.enabled = mask;

                ubx_table(device, ((mask & GNSS_CONSTELLATION_GLONASS) ? ubx_constellation_gps_glonass_table : ubx_constellation_gps_table));
            }
        }
        break;
    }

    return true;
}

bool gnss_set_sbas(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        ubx_table(device, (enable ? ubx_sbas_enable_table :  ubx_sbas_disable_table));
        break;
    }

    return true;
}

bool gnss_set_qzss(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        ubx_table(device, (enable ? ubx_qzss_enable_table :  ubx_qzss_disable_table));
        break;
    }

    return true;
}

bool gnss_set_autonomous(bool enable)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
	ubx_table(device, (enable ? ubx_aop_enable_table :  ubx_aop_disable_table));
        break;
    }

    return true;
}

bool gnss_set_platform(unsigned int platform)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;

    static const uint8_t ubx_platform_table[GNSS_PLATFORM_COUNT] = {
        0x00, /* PORTABLE   */
        0x02, /* STATIONARY */
        0x03, /* PEDESTRIAN */
        0x04, /* CAR        */
        0x05, /* SEA        */
        0x06, /* BALLON     */
        0x07, /* AVIATION   */
    };

    if (gnss_busy())
    {
        return false;
    }

    if (platform >= GNSS_PLATFORM_COUNT)
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        data = &device->tx_data[0];
        table = &device->tx_table[0];

        memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
        
        data[ 0] = 0xb5;
        data[ 1] = 0x62;
        data[ 2] = 0x06;
        data[ 3] = 0x24;
        data[ 4] = 0x24;
        data[ 5] = 0x00;
        data[ 6] = 0x01;
        data[ 7] = 0x00;
        data[ 8] = ubx_platform_table[platform];
        
        ubx_checksum(data);

        table[0] = ubx_cfg_rxm_continuous;
        table[1] = ubx_cfg_pm2;
        table[2] = &data[0];
        table[3] = ubx_cfg_save;
        table[4] = NULL;

        ubx_table(device, table);
    }

    return true;
}

bool gnss_set_periodic(unsigned int acqTime, unsigned int onTime, unsigned int period)
{
    gnss_device_t *device = &gnss_device;
    const uint8_t **table;
    uint8_t *data;
    unsigned int minAcqTime, updatePeriod, searchPeriod, gridOffset;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        if (onTime == 0)
        {
            acqTime      = 0;
            minAcqTime   = 0;
            updatePeriod = 1000;
            searchPeriod = 10000;
            gridOffset   = 0;
        }
        else
        {
            if (acqTime > 255)
            {
                acqTime = 255;
            }

            minAcqTime   = 0;
            updatePeriod = period * 1000;
            searchPeriod = period * 1000;
            gridOffset   = 0;
        }

        data = &device->tx_data[0];
        table = &device->tx_table[0];

        memset(&data[0], 0, sizeof(GNSS_TX_DATA_SIZE));
        
        data[ 0] = 0xb5;
        data[ 1] = 0x62;
        data[ 2] = 0x06;
        data[ 3] = 0x3b;
        data[ 4] = 0x2c;
        data[ 5] = 0x00;
        data[ 6] = 0x01;
        data[ 7] = 0x00;
        data[ 8] = acqTime;
        data[ 9] = 0x00;
        data[10] = 0x00;
        data[11] = 0x1d;
        data[12] = ((onTime && (updatePeriod > 10000)) ? 0x00 : 0x02);
        data[13] = 0x00;
        data[14] = updatePeriod >> 0;
        data[15] = updatePeriod >> 8;
        data[16] = updatePeriod >> 16;
        data[17] = updatePeriod >> 24;
        data[18] = searchPeriod >> 0;
        data[19] = searchPeriod >> 8;
        data[20] = searchPeriod >> 16;
        data[21] = searchPeriod >> 24;
        data[22] = gridOffset >> 0;
        data[23] = gridOffset >> 8;
        data[24] = gridOffset >> 16;
        data[25] = gridOffset >> 24;
        data[26] = onTime >> 0;
        data[27] = onTime >> 8;
        data[28] = minAcqTime >> 0;
        data[29] = minAcqTime >> 8;
        
        ubx_checksum(data);

        table[0] = ubx_cfg_rxm_continuous;
        table[1] = &data[0];

        if (onTime)
        {
            table[2] = ubx_cfg_rxm_powersave;
            table[3] = ubx_cfg_save;
            table[4] = NULL;
        }
        else
        {
            table[2] = ubx_cfg_save;
            table[3] = NULL;
        }

        ubx_table(device, table);
    }

    return true;
}

bool gnss_suspend(void)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        ubx_send(device, (device->callbacks->disable_callback ? ubx_gnss_stop : ubx_rxm_pmreq));
        break;
    }

    return true;
}

bool gnss_resume(void)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    switch (device->mode) {
    case GNSS_MODE_NMEA:
        break;
    case GNSS_MODE_UBLOX:
        if (device->callbacks->enable_callback)
        {
            (*device->callbacks->enable_callback)(device->context);
        }
        else
        {
            ubx_table(device, ubx_gnss_wakeup_table);
        }

        device->busy = 1;
        device->wakeup = 1;
        break;
    }

    return true;
}

bool gnss_busy(void)
{
    gnss_device_t *device = &gnss_device;

    if (device->table != NULL)
    {
        return true;
    }

    if (device->busy)
    {
        return true;
    }

    return false;
}

bool gnss_info(uint8_t *p_protocol, uint8_t *p_firmware, uint32_t *p_llc)
{
    gnss_device_t *device = &gnss_device;

    if (gnss_busy())
    {
        return false;
    }

    if (device->mode != GNSS_MODE_UBLOX) {
	return false;
    }

    if (p_protocol)
    {
	p_protocol[0] = device->ubx.protocol[0];
	p_protocol[1] = device->ubx.protocol[1];
    }

    if (p_firmware)
    {
	memcpy(p_firmware, &device->ubx.firmware[0], sizeof(device->ubx.firmware[0]));
    }
    
    if (p_llc)
    {
	memcpy((uint8_t*)p_llc, (uint8_t*)&device->ubx.llc[0], sizeof(device->ubx.llc[0]));
    }

    return true;
}
